In [1]:
import numpy as np
import pandas as pd

# 1. Series

[`pandas.Series`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html): pretty similar to 1d nparray, can be indexed using labels.

In [2]:
labels = [chr(ord('a') + i) for i in range(6)]
values = [i for i in range(6)]
print(f'labels = {labels}')
print(f'values = {values}')

labels = ['a', 'b', 'c', 'd', 'e', 'f']
values = [0, 1, 2, 3, 4, 5]

In [3]:
series = pd.Series(data=values, index=labels)
print(series)

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [4]:
series['d']

3

In [5]:
d = dict(zip(labels, values))
s2 = pd.Series(d)
print(s2)

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

# 2. Pandas DataFrames

Dataframes are a number of series that share the same index.

## 2.1. Create

DataFrames can be created, or imported from csv files.

In [6]:
data = np.random.randn(5, 3)
index = [chr(ord('a') + i) for i in range(data.shape[0])]
columns = [chr(ord('m') + i) for i in range(data.shape[1])]

In [7]:
df = pd.DataFrame(data=data, index=index, columns=columns)

In [8]:
df

          m         n         o
a -0.015537  0.269408  0.086285
b -1.101011 -1.034281 -0.633671
c -1.100190  0.401816  1.562977
d  1.051363 -1.491945 -1.575996
e  0.059770  0.112994  0.570224

## 2.2. Add a column

In [13]:
df

          m         n         o
a -0.015537  0.269408  0.086285
b -1.101011 -1.034281 -0.633671
c -1.100190  0.401816  1.562977
d  1.051363 -1.491945 -1.575996
e  0.059770  0.112994  0.570224

In [14]:
df['p'] = df['m'] + df['o']

In [15]:
df

          m         n         o         p
a -0.015537  0.269408  0.086285  0.070749
b -1.101011 -1.034281 -0.633671 -1.734682
c -1.100190  0.401816  1.562977  0.462788
d  1.051363 -1.491945 -1.575996 -0.524634
e  0.059770  0.112994  0.570224  0.629993

## 2.3. Remove columns/rows

### 2.3.1. Remove a column

In [38]:
df.drop(labels=['m'], axis=1)

          n         o         p
a  0.269408  0.086285  0.070749
b -1.034281 -0.633671 -1.734682
c  0.401816  1.562977  0.462788
d -1.491945 -1.575996 -0.524634
e  0.112994  0.570224  0.629993

### 2.3.2. Remove a row

In [40]:
df.drop('c', axis=0)

          m         n         o         p
a -0.015537  0.269408  0.086285  0.070749
b -1.101011 -1.034281 -0.633671 -1.734682
d  1.051363 -1.491945 -1.575996 -0.524634
e  0.059770  0.112994  0.570224  0.629993

## 2.4. Select

### 2.4.1. Select columns

In [9]:
df['m']

a   -0.015537
b   -1.101011
c   -1.100190
d    1.051363
e    0.059770
Name: m, dtype: float64

In [10]:
type(df['m'])

pandas.core.series.Series

In [11]:
df[['m', 'o']]

          m         o
a -0.015537  0.086285
b -1.101011 -0.633671
c -1.100190  1.562977
d  1.051363 -1.575996
e  0.059770  0.570224

In [12]:
type(df[['m', 'o']])

pandas.core.frame.DataFrame

### 2.4.2. Select rows

#### 2.4.2.1. Select using Label

In [28]:
row1 = df.loc['d']
print(row1)
print(type(row1))

m    1.051363
n   -1.491945
o   -1.575996
p   -0.524634
Name: d, dtype: float64
<class 'pandas.core.series.Series'>

In [34]:
rows = df.loc[['a', 'd']]

In [35]:
rows

          m         n         o         p
a -0.015537  0.269408  0.086285  0.070749
d  1.051363 -1.491945 -1.575996 -0.524634

#### 2.4.2.2. Select using numeric index

In [30]:
row1b = df.iloc[3]
print(row1b)

m    1.051363
n   -1.491945
o   -1.575996
p   -0.524634
Name: d, dtype: float64

In [31]:
rows = df.iloc[2:4]

In [32]:
rows

          m         n         o         p
c -1.100190  0.401816  1.562977  0.462788
d  1.051363 -1.491945 -1.575996 -0.524634

### 2.4.3. Select rows and columns simultaneously

In [42]:
df.loc[['a', 'd'], ['m', 'n']] # rows first, columns second

          m         n
a -0.015537  0.269408
d  1.051363 -1.491945

### 2.4.4. Select with Conditions

#### 2.4.4.1. Boolean Mask

In [43]:
df

          m         n         o         p
a -0.015537  0.269408  0.086285  0.070749
b -1.101011 -1.034281 -0.633671 -1.734682
c -1.100190  0.401816  1.562977  0.462788
d  1.051363 -1.491945 -1.575996 -0.524634
e  0.059770  0.112994  0.570224  0.629993

In [44]:
df > 0

       m      n      o      p
a  False   True   True   True
b  False  False  False  False
c  False   True   True   True
d   True  False  False  False
e   True   True   True   True

In [45]:
df[df > 0]

          m         n         o         p
a       NaN  0.269408  0.086285  0.070749
b       NaN       NaN       NaN       NaN
c       NaN  0.401816  1.562977  0.462788
d  1.051363       NaN       NaN       NaN
e  0.059770  0.112994  0.570224  0.629993

#### 2.4.4.2. Select row with condition

* **One condition**

In [58]:
df[df['m'] > 0]

          m         n         o         p
d  1.051363 -1.491945 -1.575996 -0.524634
e  0.059770  0.112994  0.570224  0.629993

* **Multiple conditions**

In [57]:
df[(df['m'] > 0) & (df['n'] < 0)]

          m         n         o         p
d  1.051363 -1.491945 -1.575996 -0.524634

## 2.5. Impute/Deal with Missing Data

In [67]:
dfm = df[df > 0]

In [68]:
dfm

          m         n         o         p
a       NaN  0.269408  0.086285  0.070749
b       NaN       NaN       NaN       NaN
c       NaN  0.401816  1.562977  0.462788
d  1.051363       NaN       NaN       NaN
e  0.059770  0.112994  0.570224  0.629993

### 2.5.1. Drop rows

* Drop all rows that has any `NaN` value.

In [72]:
dfm.dropna()

         m         n         o         p
e  0.05977  0.112994  0.570224  0.629993

* Drop all rows that has `NaN` in a specific column

In [73]:
dfm[dfm['m'].notna()]

          m         n         o         p
d  1.051363       NaN       NaN       NaN
e  0.059770  0.112994  0.570224  0.629993

### 2.5.2. Fill with values

* Fill all `NaN` cells with a specific value.

In [75]:
dfm.fillna(value=12345)

              m             n             o             p
a  12345.000000      0.269408      0.086285      0.070749
b  12345.000000  12345.000000  12345.000000  12345.000000
c  12345.000000      0.401816      1.562977      0.462788
d      1.051363  12345.000000  12345.000000  12345.000000
e      0.059770      0.112994      0.570224      0.629993

* Fill all `NaN` cells in a column with the mean of that column

In [76]:
dfm['m'].fillna(value=dfm['m'].mean())

a    0.555566
b    0.555566
c    0.555566
d    1.051363
e    0.059770
Name: m, dtype: float64

* Fill all `NaN` cells in the dataframe - each cell is filled with the mean value of its columns

In [79]:
dfm

          m         n         o         p
a       NaN  0.269408  0.086285  0.070749
b       NaN       NaN       NaN       NaN
c       NaN  0.401816  1.562977  0.462788
d  1.051363       NaN       NaN       NaN
e  0.059770  0.112994  0.570224  0.629993

In [80]:
dfm.fillna(dfm.mean())

          m         n         o         p
a  0.555566  0.269408  0.086285  0.070749
b  0.555566  0.261406  0.739829  0.387843
c  0.555566  0.401816  1.562977  0.462788
d  1.051363  0.261406  0.739829  0.387843
e  0.059770  0.112994  0.570224  0.629993

## 2.6. `groupby` and aggregate functions

In [92]:
data = {
    'Student': ['Adam', 'Adam', 'Clair', 'Bob', 'Clair', 'Bob'],
    'Course':  ['MATH1001', 'MATH2002', 'MATH2002', 'MATH2002', 'MATH1001', 'MATH1001'],
    'Mark':    [     5,      6,       5,     4,      7,      6]
}

In [93]:
data

{'Student': ['Adam', 'Adam', 'Clair', 'Bob', 'Clair', 'Bob'],
 'Course': ['MATH1001',
  'MATH2002',
  'MATH2002',
  'MATH2002',
  'MATH1001',
  'MATH1001'],
 'Mark': [5, 6, 5, 4, 7, 6]}

In [94]:
df = pd.DataFrame(data)

In [95]:
df

  Student    Course  Mark
0    Adam  MATH1001     5
1    Adam  MATH2002     6
2   Clair  MATH2002     5
3     Bob  MATH2002     4
4   Clair  MATH1001     7
5     Bob  MATH1001     6

In [97]:
df.groupby('Student').max()

           Course  Mark
Student
Adam     MATH2002     6
Bob      MATH2002     6
Clair    MATH2002     7

In [98]:
df.groupby('Course').mean()

          Mark
Course
MATH1001     6
MATH2002     5

## 2.7. Column Operations

### 2.7.1. Unique values in a column

In [100]:
df

  Student    Course  Mark
0    Adam  MATH1001     5
1    Adam  MATH2002     6
2   Clair  MATH2002     5
3     Bob  MATH2002     4
4   Clair  MATH1001     7
5     Bob  MATH1001     6

In [102]:
df['Student'].unique()

array(['Adam', 'Clair', 'Bob'], dtype=object)

In [103]:
df['Student'].nunique()

3

In [104]:
df['Student'].value_counts()

Adam     2
Clair    2
Bob      2
Name: Student, dtype: int64

### 2.7.2. Apply a function

In [106]:
df['Mark']

0    5
1    6
2    5
3    4
4    7
5    6
Name: Mark, dtype: int64

In [107]:
def add1(x):
    return x + 1

In [108]:
df['Mark'].apply(add1)

0    6
1    7
2    6
3    5
4    8
5    7
Name: Mark, dtype: int64

In [109]:
df['Mark'].apply(lambda x: x + 1)

0    6
1    7
2    6
3    5
4    8
5    7
Name: Mark, dtype: int64

### 2.7.3. Sort by a column

In [110]:
df

  Student    Course  Mark
0    Adam  MATH1001     5
1    Adam  MATH2002     6
2   Clair  MATH2002     5
3     Bob  MATH2002     4
4   Clair  MATH1001     7
5     Bob  MATH1001     6

In [111]:
df.sort_values(by='Mark')

  Student    Course  Mark
3     Bob  MATH2002     4
0    Adam  MATH1001     5
2   Clair  MATH2002     5
1    Adam  MATH2002     6
5     Bob  MATH1001     6
4   Clair  MATH1001     7

In [113]:
df.sort_values(by=['Mark', 'Student'])

  Student    Course  Mark
3     Bob  MATH2002     4
0    Adam  MATH1001     5
2   Clair  MATH2002     5
1    Adam  MATH2002     6
5     Bob  MATH1001     6
4   Clair  MATH1001     7

# 3. Input Data

## 3.1. csv files

* Use the `pd.read_csv(file_path)` function.